<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f78230d6d9826d86b03b99d7c0d90163ebb563abdc8944312b5852e2db21ff30","plan_job_ref":"Job Validations on PR #17 at https://github.com/SelfOverflow/discord-bots/actions/runs/22235878424","plan_out_hash":"87f2e742d0484bfb6231aa064835ef17aa46a2f2c601eb2db038b18a641d0eca","plan_hash":"46a3373b10dd191d947daac3c0eea278ee5b24f478eb6f74245da75c1f8dde38","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "ap-south-1"
+       tags                                 = {
+           "Name" = "main"
        }
+       tags_all                             = {
+           "Name" = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #6](https://github.com/SelfOverflow/discord-bots/actions/runs/22236010502)